app/controllers/notes_controller.rb

  def index
    @note = Note.all
---
SELECT "notes".* FROM "notes"

  def create
    @note = Note.new(note_params)

    respond_to do |format|
      if @note.save
---
INSERT INTO "notes" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "jkl"], ["body", "m,,"], ["created_at", "2018-04-03 22:10:27.139219"], ["updated_at", "2018-04-03 22:10:27.139219"]]

  def destroy
    Note.find(params[:id])
    @note.destroy
---
SELECT  "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 1]]